In [1]:
import pandas as pd
import numpy as np

In [2]:
s = s = pd.Series([1,2,6,7,np.nan,9,10,11]) #리스트 형태의 값들로 Series를 생성

In [3]:
s

0     1.0
1     2.0
2     6.0
3     7.0
4     NaN
5     9.0
6    10.0
7    11.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6) # numpy 배열로 부터 dataframe 을 생성

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [7]:
df # index 값을 날짜로 사용, 열 이름 A,B,C,D

                   A         B         C         D
2013-01-01 -0.877260  0.824536 -0.484570 -0.583992
2013-01-02 -2.028032 -0.343961  0.153556  0.242912
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809
2013-01-04 -0.278468  0.621267 -0.062605 -0.622226
2013-01-05  0.045598 -0.691996 -0.566960  0.624947
2013-01-06  1.446088 -0.634451 -1.037672 -0.151491

In [10]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes # 각 열은 각각 다른 타입의 데이터를 가지고있음

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head() # 괄호안의 숫자만큼의 시작 줄을 df에서 보여준다. 기본값 : 5

                   A         B         C         D
2013-01-01 -0.877260  0.824536 -0.484570 -0.583992
2013-01-02 -2.028032 -0.343961  0.153556  0.242912
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809
2013-01-04 -0.278468  0.621267 -0.062605 -0.622226
2013-01-05  0.045598 -0.691996 -0.566960  0.624947

In [14]:
df.tail(3) # 괄호안의 숫자만큼의 마지막 줄을 df에서 보여준다. 기본값 : 5

                   A         B         C         D
2013-01-04 -0.278468  0.621267 -0.062605 -0.622226
2013-01-05  0.045598 -0.691996 -0.566960  0.624947
2013-01-06  1.446088 -0.634451 -1.037672 -0.151491

In [15]:
df.index # 인덱스 값

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns # 열 값

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
# numpy 형태로 보기

In [20]:
df.to_numpy()

array([[-0.87725977,  0.82453602, -0.48456986, -0.58399193],
       [-2.0280315 , -0.34396118,  0.15355642,  0.24291209],
       [-1.05008213, -1.28160928, -0.41562887, -0.14080877],
       [-0.27846766,  0.62126689, -0.06260462, -0.62222583],
       [ 0.04559795, -0.69199638, -0.56695981,  0.62494672],
       [ 1.44608813, -0.63445068, -1.03767167, -0.15149126]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
# df2 각 컬럼의 데이터 타입이 다를 경우 시간이나 리소스를 많이 소모할 수 있다. 왜냐하면, Pandas는 각 열별로 다른 타입을 가질 수 있는 반면에 NumPy는 배열 전체가 하나의 타입을 가져야 하기 때문이다.

In [22]:
df.describe() # 간단한 통계 정보

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.457026 -0.251036 -0.402313 -0.105110
std    1.174966  0.816080  0.415241  0.480472
min   -2.028032 -1.281609 -1.037672 -0.622226
25%   -1.006877 -0.677610 -0.546362 -0.475867
50%   -0.577864 -0.489206 -0.450099 -0.146150
75%   -0.035418  0.379960 -0.150861  0.146982
max    1.446088  0.824536  0.153556  0.624947

In [23]:
df.T # 전치행렬

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.877260   -2.028032   -1.050082   -0.278468    0.045598    1.446088
B    0.824536   -0.343961   -1.281609    0.621267   -0.691996   -0.634451
C   -0.484570    0.153556   -0.415629   -0.062605   -0.566960   -1.037672
D   -0.583992    0.242912   -0.140809   -0.622226    0.624947   -0.151491

In [25]:
# axis = 0 (index 정렬, 기본값)
# axis = 1 (열 정렬)
# ascending = True (오름차순, 기본값)
# ascending = False (내림차순)

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.583992 -0.484570  0.824536 -0.877260
2013-01-02  0.242912  0.153556 -0.343961 -2.028032
2013-01-03 -0.140809 -0.415629 -1.281609 -1.050082
2013-01-04 -0.622226 -0.062605  0.621267 -0.278468
2013-01-05  0.624947 -0.566960 -0.691996  0.045598
2013-01-06 -0.151491 -1.037672 -0.634451  1.446088

In [27]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809
2013-01-05  0.045598 -0.691996 -0.566960  0.624947
2013-01-06  1.446088 -0.634451 -1.037672 -0.151491
2013-01-02 -2.028032 -0.343961  0.153556  0.242912
2013-01-04 -0.278468  0.621267 -0.062605 -0.622226
2013-01-01 -0.877260  0.824536 -0.484570 -0.583992

In [28]:
df['A'] # 한 개의 열 선택

2013-01-01   -0.877260
2013-01-02   -2.028032
2013-01-03   -1.050082
2013-01-04   -0.278468
2013-01-05    0.045598
2013-01-06    1.446088
Freq: D, Name: A, dtype: float64

In [29]:
df[0:3] # 행 분할 선택 (slicing)

                   A         B         C         D
2013-01-01 -0.877260  0.824536 -0.484570 -0.583992
2013-01-02 -2.028032 -0.343961  0.153556  0.242912
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809

In [31]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -2.028032 -0.343961  0.153556  0.242912
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809
2013-01-04 -0.278468  0.621267 -0.062605 -0.622226

In [32]:
df.loc[dates[0]] # 한 개의 Label로 선택

A   -0.877260
B    0.824536
C   -0.484570
D   -0.583992
Name: 2013-01-01 00:00:00, dtype: float64

In [34]:
df.loc[:, ['A','B']] # 여러 축으로 선택

                   A         B
2013-01-01 -0.877260  0.824536
2013-01-02 -2.028032 -0.343961
2013-01-03 -1.050082 -1.281609
2013-01-04 -0.278468  0.621267
2013-01-05  0.045598 -0.691996
2013-01-06  1.446088 -0.634451

In [35]:
df.loc['20130102':'20130104',['A','B']] # 행 분할, 특정 열 선택

                   A         B
2013-01-02 -2.028032 -0.343961
2013-01-03 -1.050082 -1.281609
2013-01-04 -0.278468  0.621267

In [36]:
df.loc[dates[0],'A'] #스칼라 값

-0.8772597658788468

In [37]:
df.at[dates[0],'A'] # 더 빠르게 얻기 sys랑ㅂ ㅣ슷

-0.8772597658788468

In [38]:
df.iloc[3] # 정수값 위치를 통한 선택

A   -0.278468
B    0.621267
C   -0.062605
D   -0.622226
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
df.iloc[3:5,0:2] #분할해서 선택하기

                   A         B
2013-01-04 -0.278468  0.621267
2013-01-05  0.045598 -0.691996

In [40]:
df.iloc[[1,2,4],[0,2]] #특정 행, 열 선택

                   A         C
2013-01-02 -2.028032  0.153556
2013-01-03 -1.050082 -0.415629
2013-01-05  0.045598 -0.566960

In [42]:
df.iloc[1:3,:] # 특정 행 선택

                   A         B         C         D
2013-01-02 -2.028032 -0.343961  0.153556  0.242912
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809

In [43]:
df.iloc[:, 1:3] # 특정 열

                   B         C
2013-01-01  0.824536 -0.484570
2013-01-02 -0.343961  0.153556
2013-01-03 -1.281609 -0.415629
2013-01-04  0.621267 -0.062605
2013-01-05 -0.691996 -0.566960
2013-01-06 -0.634451 -1.037672

In [44]:
df[df.A>0] # 조건식을 만족하는 열을 가진 행만 선택

                   A         B         C         D
2013-01-05  0.045598 -0.691996 -0.566960  0.624947
2013-01-06  1.446088 -0.634451 -1.037672 -0.151491

In [45]:
df[df>0] # 만족하지 않으면 NaN

                   A         B         C         D
2013-01-01       NaN  0.824536       NaN       NaN
2013-01-02       NaN       NaN  0.153556  0.242912
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN  0.621267       NaN       NaN
2013-01-05  0.045598       NaN       NaN  0.624947
2013-01-06  1.446088       NaN       NaN       NaN

In [46]:
df2 = df.copy()

In [47]:
df2['E'] = ['one','one','two','three','four','three']

In [48]:
df2

                   A         B         C         D      E
2013-01-01 -0.877260  0.824536 -0.484570 -0.583992    one
2013-01-02 -2.028032 -0.343961  0.153556  0.242912    one
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809    two
2013-01-04 -0.278468  0.621267 -0.062605 -0.622226  three
2013-01-05  0.045598 -0.691996 -0.566960  0.624947   four
2013-01-06  1.446088 -0.634451 -1.037672 -0.151491  three

In [49]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.050082 -1.281609 -0.415629 -0.140809   two
2013-01-05  0.045598 -0.691996 -0.566960  0.624947  four

In [50]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [51]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [52]:
df['F'] = s1 # series 로 설정

In [53]:
df.at[dates[0],'A'] = 0 # 레이블로 설정

In [54]:
df.iat[0,1] = 0 # 위치로 설정

In [56]:
df.loc[:,'D'] = np.array([5]*len(df)) # 배열로 설정

In [57]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.484570  5  NaN
2013-01-02 -2.028032 -0.343961  0.153556  5  1.0
2013-01-03 -1.050082 -1.281609 -0.415629  5  2.0
2013-01-04 -0.278468  0.621267 -0.062605  5  3.0
2013-01-05  0.045598 -0.691996 -0.566960  5  4.0
2013-01-06  1.446088 -0.634451 -1.037672  5  5.0

In [58]:
df2 = df.copy()

In [59]:
df[df>0] = -df2

In [60]:
df2 # 특정 조건을 만족하는 곳의 값만 변경

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.484570  5  NaN
2013-01-02 -2.028032 -0.343961  0.153556  5  1.0
2013-01-03 -1.050082 -1.281609 -0.415629  5  2.0
2013-01-04 -0.278468  0.621267 -0.062605  5  3.0
2013-01-05  0.045598 -0.691996 -0.566960  5  4.0
2013-01-06  1.446088 -0.634451 -1.037672  5  5.0

In [65]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+['E']) # index 를 추가/삭제 하고 결과 return

In [66]:
df.loc[dates[0]:dates[1],'E'] = 1

In [67]:
df1 # missing data = np.nan 으로 표시, 계산에서 제외

                   A         B         C  D    F    E    E
2013-01-01  0.000000  0.000000 -0.484570 -5  NaN  1.0  1.0
2013-01-02 -2.028032 -0.343961 -0.153556 -5 -1.0  1.0  1.0
2013-01-03 -1.050082 -1.281609 -0.415629 -5 -2.0  NaN  NaN
2013-01-04 -0.278468 -0.621267 -0.062605 -5 -3.0  NaN  NaN

In [68]:
df1.dropna(how='any') # misisng data 가 있는 행 삭제

                   A         B         C  D    F    E    E
2013-01-02 -2.028032 -0.343961 -0.153556 -5 -1.0  1.0  1.0

In [69]:
df1.fillna(value=5) # missing data 채우기

                   A         B         C  D    F    E    E
2013-01-01  0.000000  0.000000 -0.484570 -5  5.0  1.0  1.0
2013-01-02 -2.028032 -0.343961 -0.153556 -5 -1.0  1.0  1.0
2013-01-03 -1.050082 -1.281609 -0.415629 -5 -2.0  5.0  5.0
2013-01-04 -0.278468 -0.621267 -0.062605 -5 -3.0  5.0  5.0

In [71]:
pd.isna(df1) # NaN 값을 가진곳의 불리언 마스크 생성 (NaN = True)

                A      B      C      D      F      E      E
2013-01-01  False  False  False  False   True  False  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True   True
2013-01-04  False  False  False  False  False   True   True

In [72]:
df.mean() # 각 열의 평균

A   -0.808045
B   -0.595547
C   -0.453499
D   -5.000000
F   -3.000000
E    1.000000
dtype: float64

In [73]:
df.mean(1) # 각 행의 평균

2013-01-01   -0.896914
2013-01-02   -1.254258
2013-01-03   -1.949464
2013-01-04   -1.792468
2013-01-05   -2.060911
2013-01-06   -2.623642
Freq: D, dtype: float64

In [74]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [75]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [76]:
df.sub(s, axis='index')

                   A         B         C     D    F   E
2013-01-01       NaN       NaN       NaN   NaN  NaN NaN
2013-01-02       NaN       NaN       NaN   NaN  NaN NaN
2013-01-03 -2.050082 -2.281609 -1.415629  -6.0 -3.0 NaN
2013-01-04 -3.278468 -3.621267 -3.062605  -8.0 -6.0 NaN
2013-01-05 -5.045598 -5.691996 -5.566960 -10.0 -9.0 NaN
2013-01-06       NaN       NaN       NaN   NaN  NaN NaN

In [77]:
df.apply(np.cumsum) # numpy 의 cumsum 함수 적용

                   A         B         C   D     F    E
2013-01-01  0.000000  0.000000 -0.484570  -5   NaN  1.0
2013-01-02 -2.028032 -0.343961 -0.638126 -10  -1.0  2.0
2013-01-03 -3.078114 -1.625570 -1.053755 -15  -3.0  NaN
2013-01-04 -3.356581 -2.246837 -1.116360 -20  -6.0  NaN
2013-01-05 -3.402179 -2.938834 -1.683320 -25 -10.0  NaN
2013-01-06 -4.848267 -3.573284 -2.720991 -30 -15.0  NaN

In [79]:
df.apply(lambda x: x.max() - x.min()) #람다함수 적용 ( 각 열의 최댓값-최솟값 계산)

A    2.028032
B    1.281609
C    0.975067
D    0.000000
F    4.000000
E    0.000000
dtype: float64

In [80]:
s = pd.Series(np.random.randint(0,7, size = 10))

In [81]:
s

0    3
1    6
2    4
3    5
4    0
5    6
6    4
7    5
8    6
9    6
dtype: int32

In [82]:
s.value_counts() # value_counts 로 각 값의 분포를 알 수 있다.

6    4
4    2
5    2
3    1
0    1
dtype: int64

In [83]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [84]:
s.str.lower() # 모든 문자를 소문자로 변경

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [85]:
df = pd.DataFrame(np.random.randn(10, 4))

In [86]:
df

          0         1         2         3
0 -0.980790 -0.565477 -0.152286 -1.415464
1  0.388114 -2.282572 -0.951545  0.987910
2 -0.879561 -0.653351  0.318086  0.312837
3 -0.356690  0.676962  1.334488 -0.620570
4  0.021074  0.698269  1.274051 -1.534792
5  1.055511 -0.369313  1.448603 -0.854302
6  0.154684  1.894781 -0.819639  0.611714
7 -2.602388  0.382186 -0.458782  0.386384
8 -1.157401  1.266547  1.311579 -0.612959
9  0.910061  0.501211 -0.595853 -1.062621

In [87]:
pieces = [df[:3], df[3:7], df[7:]] # df 를 3조각으로 나눈다

In [88]:
pd.concat(pieces) #df 를 다시 합친다

          0         1         2         3
0 -0.980790 -0.565477 -0.152286 -1.415464
1  0.388114 -2.282572 -0.951545  0.987910
2 -0.879561 -0.653351  0.318086  0.312837
3 -0.356690  0.676962  1.334488 -0.620570
4  0.021074  0.698269  1.274051 -1.534792
5  1.055511 -0.369313  1.448603 -0.854302
6  0.154684  1.894781 -0.819639  0.611714
7 -2.602388  0.382186 -0.458782  0.386384
8 -1.157401  1.266547  1.311579 -0.612959
9  0.910061  0.501211 -0.595853 -1.062621

In [89]:
left = pd.DataFrame({'key': ['foo','foo'],'lval':[1,2]})

In [93]:
right = pd.DataFrame({'key':['foo','foo'], 'rval':[4,5]})

In [94]:
left

   key  lval
0  foo     1
1  foo     2

In [95]:
right #

   key  rval
0  foo     4
1  foo     5

In [97]:
pd.merge(left, right, on='key') # SQL의 join과 같은 방식으로 데이터를 merge()로 결합

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [98]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [99]:
df # 새로운 행 추가

          A         B         C         D
0 -0.817125  0.598743  0.594677 -0.057363
1  0.884680 -0.033687 -0.575746 -1.448753
2 -0.563345  0.603564 -0.114379  1.149306
3 -1.316877  0.534407 -2.031526 -0.238852
4  0.952328  0.420534 -0.955228  0.296828
5 -1.198430 -0.770167 -0.980345 -1.319123
6 -0.756657 -0.879340 -0.571500  0.297677
7  0.766789 -0.285086  0.721729 -0.581121

In [100]:
s = df.iloc[3]

In [101]:
df.append(s, ignore_index= True)

C:\Users\wjdrl\AppData\Local\Temp/ipykernel_13260/840664371.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s, ignore_index= True)

          A         B         C         D
0 -0.817125  0.598743  0.594677 -0.057363
1  0.884680 -0.033687 -0.575746 -1.448753
2 -0.563345  0.603564 -0.114379  1.149306
3 -1.316877  0.534407 -2.031526 -0.238852
4  0.952328  0.420534 -0.955228  0.296828
5 -1.198430 -0.770167 -0.980345 -1.319123
6 -0.756657 -0.879340 -0.571500  0.297677
7  0.766789 -0.285086  0.721729 -0.581121
8 -1.316877  0.534407 -2.031526 -0.238852

In [103]:
df = pd.DataFrame({'A':['foo','bar','foo','bar',
                       'foo','bar','foo','foo'],
                  'B':['one','one','two','three',
                      'two','two','one','three'],
                  'C':np.random.randn(8),
                  'D':np.random.randn(8)})

In [104]:
df

     A      B         C         D
0  foo    one  0.510730 -0.651968
1  bar    one -0.265784  1.084557
2  foo    two  1.804348 -1.031119
3  bar  three  0.546307  0.031326
4  foo    two -1.069148 -1.395102
5  bar    two -1.802521 -0.377568
6  foo    one -0.411380 -1.271970
7  foo  three -1.028133  0.231374

In [105]:
df.groupby('A').sum()

            C         D
A
bar -1.521998  0.738315
foo -0.193584 -4.118785

In [106]:
# 그룹화는 여러 기준에 따라 데이터를 여러 기준으로 분할하거나 각 그룹에 독립적으로   함수를 적용하거나 연산의 결과물들을 하나의 자료구조로 결합하는 것을 의미한다

In [107]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.265784  1.084557
    three  0.546307  0.031326
    two   -1.802521 -0.377568
foo one    0.099350 -1.923938
    three -1.028133  0.231374
    two    0.735199 -2.426220